<a href="https://colab.research.google.com/github/immy78/Deep_Learning/blob/master/Artificial_Neural_Network.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Flatten,Dense

In [ ]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

In [ ]:
!wget https://raw.githubusercontent.com/laxmimerit/Building-Your-First-ANN-with-TensorFlow-2.0/master/Customer_Churn_Modelling.csv

--2020-08-26 06:07:45--  https://raw.githubusercontent.com/laxmimerit/Building-Your-First-ANN-with-TensorFlow-2.0/master/Customer_Churn_Modelling.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 684858 (669K) [text/plain]
Saving to: ‘Customer_Churn_Modelling.csv’

Customer_Churn_Mode 100%[===================>] 668.81K  --.-KB/s    in 0.1s

2020-08-26 06:07:46 (6.78 MB/s) - ‘Customer_Churn_Modelling.csv’ saved [684858/684858]

In [ ]:
dataset = pd.read_csv('Customer_Churn_Modelling.csv')

In [ ]:
dataset.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [ ]:
x = dataset.drop(labels=['RowNumber','CustomerId','Surname','Exited'],axis =1)
x.head()

   CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619    France  Female  ...          1               1        101348.88
1          608     Spain  Female  ...          0               1        112542.58
2          502    France  Female  ...          1               0        113931.57
3          699    France  Female  ...          0               0         93826.63
4          850     Spain  Female  ...          1               1         79084.10

[5 rows x 10 columns]

In [ ]:
y = dataset['Exited']
y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

In [ ]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
dtypes: float64(2), int64(6), object(2)
memory usage: 781.4+ KB

In [ ]:
x = pd.get_dummies(x,columns =['Geography','Gender'],drop_first=True)
x.head()

   CreditScore  Age  Tenure  ...  Geography_Germany  Geography_Spain  Gender_Male
0          619   42       2  ...                  0                0            0
1          608   41       1  ...                  0                1            0
2          502   42       8  ...                  0                0            0
3          699   39       1  ...                  0                0            0
4          850   43       2  ...                  0                1            0

[5 rows x 11 columns]

In [ ]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   CreditScore        10000 non-null  int64
 1   Age                10000 non-null  int64
 2   Tenure             10000 non-null  int64
 3   Balance            10000 non-null  float64
 4   NumOfProducts      10000 non-null  int64
 5   HasCrCard          10000 non-null  int64
 6   IsActiveMember     10000 non-null  int64
 7   EstimatedSalary    10000 non-null  float64
 8   Geography_Germany  10000 non-null  uint8
 9   Geography_Spain    10000 non-null  uint8
 10  Gender_Male        10000 non-null  uint8
dtypes: float64(2), int64(6), uint8(3)
memory usage: 654.4 KB

In [ ]:
#train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size =0.3,random_state =101,stratify=y)

In [ ]:
x_train.shape , x_test.shape

((7000, 11), (3000, 11))

In [ ]:
y_train.shape , y_test.shape

((7000,), (3000,))

In [ ]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
x_train = scaler.fit_transform(x_train)
x_test = scaler.fit_transform(x_test)

In [ ]:
# Build artificial Nural Network
model = Sequential()
model.add(Dense(x.shape[1],activation='relu',input_dim=x.shape[1])) # Input layer

model.add(Dense(128,activation='relu')) # Hidden layer

model.add(Dense(1,activation='sigmoid')) # Output layer

In [ ]:
model.compile(optimizer='adam', loss = 'binary_crossentropy',metrics = ['accuracy'])
model.fit(x_train,y_train,batch_size=10 , verbose=1,epochs=10)

Epoch 1/10
700/700 [==============================] - 1s 1ms/step - loss: 0.4596 - accuracy: 0.8007
Epoch 2/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3932 - accuracy: 0.8374
Epoch 3/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3553 - accuracy: 0.8534
Epoch 4/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3449 - accuracy: 0.8581
Epoch 5/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3394 - accuracy: 0.8593
Epoch 6/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3354 - accuracy: 0.8623
Epoch 7/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3332 - accuracy: 0.8630
Epoch 8/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3310 - accuracy: 0.8627
Epoch 9/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3283 - accuracy: 0.8653
Epoch 10/10
700/700 [==============================] - 1s 1ms/step - loss: 0.3269 - accuracy: 0.8666

In [ ]:
y_pred = model.predict_classes(x_test)

WARNING:tensorflow:From <ipython-input-39-bae1a118294d>:1: Sequential.predict_classes (from tensorflow.python.keras.engine.sequential) is deprecated and will be removed after 2021-01-01.
Instructions for updating:
Please use instead:* `np.argmax(model.predict(x), axis=-1)`,   if your model does multi-class classification   (e.g. if it uses a `softmax` last-layer activation).* `(model.predict(x) > 0.5).astype("int32")`,   if your model does binary classification   (e.g. if it uses a `sigmoid` last-layer activation).

In [ ]:
y_pred

array([[0],
       [0],
       [0],
       ...,
       [0],
       [0],
       [0]], dtype=int32)

In [ ]:
from sklearn.metrics import confusion_matrix,accuracy_score

In [ ]:
confusion_matrix(y_test,y_pred)

array([[2305,   84],
       [ 353,  258]])

In [ ]:
accuracy_score(y_test,y_pred)       #Test accuracy

0.8543333333333333

In [ ]:
model.evaluate(x_test,y_test)

94/94 [==============================] - 0s 824us/step - loss: 0.3547 - accuracy: 0.8543

[0.35467687249183655, 0.8543333411216736]